# organization-api - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Reading...
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=w6w3jgi4xf]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Read complete after 0s [id=3693445097]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-production_organization_api]
module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/production_organization_api]
module.common_resources.module.kafka_topic_credential.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=production_cockroachdb-serverless-cluster-id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=817df27a-5ac7-4775-94e2-cf6c12b3ad3c:production_organization_api]
module.common_resources.module.kafka_topic_credential.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=production_kafka-cluster-id]
module.common_resources.module.kafka_topic_credential.upstash_kafka_credential.default: Refreshing state... [id=upstash-kafka-credential-83a7c56a-4a70-4d22-a139-c1037dd93fe5]
module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/production_organization_api]
module.common_resources.module.aws_api_gateway.aws_ssm_parameter.default: Refreshing state... [id=production_organization_api_endpoint]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-production_organization_api-20230429063140636800000001]
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 2s [id=065c0cfaa4a1146ad746de34e2813da2c8e64d9b]
module.common_resources.module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=production_organization_api]
module.common_resources.module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=jb562g8]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_route.any: Refreshing state... [id=gor6lk4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "production_organization_api"
        tags                           = {
            "domain"        = "organization"
            "environment"   = "production"
            "resource"      = "organization-api"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING" = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "production_organization"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "production_organization_api"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "817df27a-5ac7-4775-94e2-cf6c12b3ad3c:production_organization_api"
        name       = "production_organization_api"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "3520bef5-7a15-4ca4-acf2-5b7dadaacc6f" -> "53d437b3-8ff4-46cc-9511-f74ffe11633e"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*